tutor-virtual-2/app/controllers/stakeholders_controller.rb

SELECT "stakeholders".* FROM "stakeholders"
---
  def index
    @stakeholders = Stakeholder.all

INSERT INTO "stakeholders" ("username", "internal_password", "name", "first_last_name", "second_last_name", "email", "country", "state", "city", "partner", "organization_code", "gender", "dob", "phone_number", "language", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @stakeholder = Stakeholder.new(stakeholder_params)

    respond_to do |format|
      if @stakeholder.save

DELETE FROM "stakeholders" WHERE "stakeholders"."id" = $1  [["id", 980190962]]
---
  def destroy
    @stakeholder.destroy

SELECT  "stakeholders".* FROM "stakeholders" WHERE "stakeholders"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_stakeholder
      @stakeholder = Stakeholder.find(params[:id])