tutor-virtual-2/app/controllers/supervisors_controller.rb

  def index
    @supervisors = Supervisor.all
---
SELECT "supervisors".* FROM "supervisors"

  def create
    @supervisor = Supervisor.new(supervisor_params)

    respond_to do |format|
      if @supervisor.save
---
INSERT INTO "supervisors" ("username", "internal_password", "name", "first_last_name", "second_last_name", "email", "country", "state", "city", "partner", "organization_code", "gender", "dob", "phone_number", "language", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

  def destroy
    @supervisor.destroy
---
DELETE FROM "supervisors" WHERE "supervisors"."id" = $1  [["id", 980190962]]

    def set_supervisor
      @supervisor = Supervisor.find(params[:id])
---
SELECT  "supervisors".* FROM "supervisors" WHERE "supervisors"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]