tutor-virtual-2/app/controllers/tutors_controller.rb

  def index
    @tutors = Tutor.all
---
SELECT "tutors".* FROM "tutors"

  def create
    @tutor = Tutor.new(tutor_params)

    respond_to do |format|
      if @tutor.save
---
INSERT INTO "tutors" ("username", "internal_password", "name", "first_last_name", "second_last_name", "email", "country", "state", "city", "partner", "organization_code", "gender", "dob", "phone_number", "language", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"

  def destroy
    @tutor.destroy
---
DELETE FROM "tutors" WHERE "tutors"."id" = $1  [["id", 980190962]]

    def set_tutor
      @tutor = Tutor.find(params[:id])
---
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]