app/controllers/coordinators_controller.rb

  def index
    @coordinators = Coordinator.all
---
SELECT "coordinators".* FROM "coordinators"

  def create
    @coordinator = Coordinator.new(coordinator_params)

    respond_to do |format|
      if @coordinator.save
---
INSERT INTO "coordinators" ("username", "internal_password", "name", "first_last_name", "second_last_name", "email", "country", "state", "city", "partner", "organization_code", "dob", "phone_number", "language", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def destroy
    @coordinator.destroy
---
DELETE FROM "coordinators" WHERE "coordinators"."id" = $1  [["id", 980190962]]

    def set_coordinator
      @coordinator = Coordinator.find(params[:id])
---
SELECT  "coordinators".* FROM "coordinators" WHERE "coordinators"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]