app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("username", "internal_password", "name", "first_last_name", "second_last_name", "email", "country", "state", "city", "partner", "organization_code", "dob", "phone_number", "language", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"